// 表示ウインドウの大きさ
// size(幅, 高さ)
size(512, 512);

// ウインドウを色で塗りつぶし
background(108,155,210);

rect( 200,395,  500, 10);
rect( 180,400,  500, 14);

line(198,255,  250, 235 );
line(198,255,  250, 275 );
line(198,255,  260, 295 );

// 円を描く（中心を指定して直径）
// circle( x：横位置, y：縦位置, 直径 )
circle( 250,270, 80 );
circle( 259,352, 115 );
circle( 276,380, 70 );
circle( 286,390, 60 );
//circle( 276,420, 40 );
//circle( 320,400, 40 );
circle( 256,346, 100 );

rect( 280,400,  24, 24);
rect( 275,405,  24, 34);
rect( 270,410,  24, 44);
rect( 265,415,  24, 54);

rect( 302,402,  24, 24);
rect( 305,405,  34, 24);
rect( 310,410,  44, 24);
rect( 315,415,  54, 24);

//circle( 256,256, 100 );
//circle( 256,256, 100 );

// 四角を描く（左上を指定して縦横）
// rect( 左上の横位置, 縦位置, 幅, 高さ )
